{"sections":{"main":{"type":"main-page","settings":{"show_page_title":true,"heading_align":"text-center"}},"d455311f-fa25-4150-80bf-556f83c4f92e":{"type":"testimonials","blocks":{"699a9857-a269-4921-a506-2b1d55e2ab5c":{"type":"testimonial","settings":{"testimonial":"<p>My daughters VB team had a disaster, their club filed for bankruptcy right before the AAU tournament in Florida. Money was lost, travel plans were ruined and the parents had to come up with the difference in order for the girls to make the trip. The girls did not want to wear the club jerseys because of the problems so I contacted AllVolleyball.com and tried to order jerseys with less than a week before the trip. The people at AllVolleyball.com did everything they could to meet our due date and exceeded all of our expectations. The total time for ordering, jersey numbering and shipping time was three days...Three Days. Every jersey was perfect, the girls loved them and wore them throughout the tournament. We never could have pulled this off without the fantastic help of AllVolleyball.com. They are the best.<\/p>","author":"David Virbick","author_info":"Aurora, CO","show_star_rating":true,"star_rating":5}},"ba847104-9391-4e11-84ce-8a53ac13009a":{"type":"testimonial","settings":{"testimonial":"<p>All Volleyball is the only company that really knows volleyball. The staff is friendly and helpful. I will always use All Volleyball for all my volleyball programs needs.<\/p>","author":"Veronica Bretzke","author_info":"Webster Groves High School","show_star_rating":true,"star_rating":5}},"8a951d6b-b43c-4d91-8ff8-59a99febbdea":{"type":"testimonial","settings":{"testimonial":"<p>All Volleyball is the ultimate all-in-one, one-stop-shop that comes to you! This is ideal for busy coaches. Every team has equipment needs and All Volleyball as it all. The service I am the most impressed with is that AV will show up and bring plenty of shoe\/gear sizes so my team can try everything on and get the correct sizes the first time. As a coach I love that I do not have to mess with order forms or money ever from parents or players. I just have to pick what I want and they do the rest.<br\/><\/p>","author":"Kym Blankenship","author_info":"Washington High School","show_star_rating":true,"star_rating":5}},"63815ea4-714d-4626-b8c2-e806fbbccae0":{"type":"testimonial","settings":{"testimonial":"<p>Thank you very much for keeping me informed. I have been very impressed with your outstanding customer service and will definitely use you again when we are ready to order uniforms for our entire program.<\/p>","author":"Dave Bosman","author_info":"Illiana Christian High School","show_star_rating":true,"star_rating":5}},"1346ad77-fd76-4566-95b4-ca286e97eb99":{"type":"testimonial","settings":{"testimonial":"<p>The people at All Volleyball are like my extended family. I have been going to All Volleyball for around 13 years; first as a beginner player in grade school, through high school and college seasons, and now as a Varsity Coach. It has always been a pleasure working with the staff at All Volleyball. They are always friendly, accommodating and professional. I have and will continue to go back to their business for seasons to come. I would recommend All Volleyball to anyone in the volleyball world from players to parents to coaches!<br\/><\/p>","author":"Liz Hickox","author_info":"Clayton High School","show_star_rating":true,"star_rating":5}}},"block_order":["699a9857-a269-4921-a506-2b1d55e2ab5c","ba847104-9391-4e11-84ce-8a53ac13009a","8a951d6b-b43c-4d91-8ff8-59a99febbdea","63815ea4-714d-4626-b8c2-e806fbbccae0","1346ad77-fd76-4566-95b4-ca286e97eb99"],"settings":{"heading":"","show_quotes":true,"testimonial_size":"h6","text_position":"justify-center","text_align":"text-center justify-center","nav_style":"slideshow_nav_lines","transition":"slide-fade","autoplay":false,"slider_pause":false,"autoplay_speed":5,"color_scheme":"default","full_width":true}},"d0111e30-dbd3-48d2-b0e3-65e40d139e36":{"type":"testimonials","blocks":{"8e721c0e-bec8-40d6-b2fd-1e1951116cab":{"type":"testimonial","settings":{"testimonial":"<p>All Volleyball is an extremely efficient location to order any and all of your volleyball needs. The selections and pricing on all of the top brands are better than any of the vendors I have used in the past. Also, the turnaround time on orders can't be beat! I will definitely be ordering more equipment and uniforms from All Volleyball in the future!<\/p>","author":"Amy Benne","author_info":"Invasion Volleyball Club","show_star_rating":true,"star_rating":5}},"1be748ae-eef5-4ea6-87f2-1deb8bf3a0ba":{"type":"testimonial","settings":{"testimonial":"<p>My experience doing business with \"All Volleyball\" has been nothing but a positive one. \"All Volleyball\" has provided for our Club since the store opened in 1995. I can't say enough about the owners, staff and the quality product they provide us. Their professionalism, customer service and personal touch are just a few of the reasons why I will continue to do business with them. Our Club needs are always met on a timely manner and the lines of communication are excellent. They go the extra mile to make sure everything is done right. I am a very happy customer!<\/p>","author":"Val Ikemeier","author_info":"St. Louis CYC Volleyball Club Director","show_star_rating":true,"star_rating":5}},"78841d6f-699d-4d14-a9c8-1ec92bea9976":{"type":"testimonial","settings":{"testimonial":"<p>All Volleyball has been a great supplier for my Club and High school program out here in CA. You just can't find better prices than All Volleyball. Thank you guys for everything!!!<\/p>","author":"Joel Hernandez","author_info":"Crush Volleyball and Watsonville High School","show_star_rating":true,"star_rating":5}},"49662040-7a18-4b92-ac54-1818fee088aa":{"type":"testimonial","settings":{"testimonial":"<p>I have been getting my volleyball supplies and equipment from All Volleyball for years. They always have everything that I need, and no one can match their prices. They also have that personal touch. I coach at least an hour away and they still drive out every year to do a shoe fitting for my team. You just can't beat them. Quite frankly, they rock!<\/p>","author":"Colin Nelson","author_info":"Troy Buchanan High School","show_star_rating":true,"star_rating":5}},"27a89e7d-49ae-45e4-85a3-ad1179169e23":{"type":"testimonial","settings":{"testimonial":"<p>All Volleyball is the best one stop shop for all of our volleyball needs. Not only can they get just about anything we need, but their service is unprecedented. The staff at All Volleyball is very helpful, friendly and accommodating, making them the only solution for our volleyball program's equipment and apparel. In short, they ROCK!<\/p>","author":"Glenn Hancock","author_info":"Rockwood Summit Volleyball","show_star_rating":true,"star_rating":5}}},"block_order":["8e721c0e-bec8-40d6-b2fd-1e1951116cab","1be748ae-eef5-4ea6-87f2-1deb8bf3a0ba","78841d6f-699d-4d14-a9c8-1ec92bea9976","49662040-7a18-4b92-ac54-1818fee088aa","27a89e7d-49ae-45e4-85a3-ad1179169e23"],"settings":{"heading":"","show_quotes":true,"testimonial_size":"h6","text_position":"justify-center","text_align":"text-center justify-center","nav_style":"slideshow_nav_lines","transition":"slide-fade","autoplay":false,"slider_pause":false,"autoplay_speed":5,"color_scheme":"1","full_width":true}},"acb231b2-126d-4b79-a8bd-bbd3912bb9dd":{"type":"testimonials","blocks":{"301931b9-5e54-4fc9-a241-3a760606d425":{"type":"testimonial","settings":{"testimonial":"<p>All Volleyball is my #1 supplier for all my volleyball needs. Whether its volleyballs, equipment or apparel their combined service, products and price is the best value in the entire industry. My relationship with the owners and staff has grown as my business has grown and I look forward to working with them for many more years to come.<\/p>","author":"Brian K. Williams","author_info":"President and CEO St. Louis Volleyball, Inc.","show_star_rating":true,"star_rating":5}},"template--21622981558558__acb231b2-126d-4b79-a8bd-bbd3912bb9dd-testimonial-1":{"type":"testimonial","settings":{"testimonial":"<p>I have been a club volleyball, middle school and high school volleyball coach for 12 years. During my experience with ordering uniforms, equipment, and other team gear, I have been able to work with many companies and people. About three years ago, I began working with All Volleyball and their staff for all of my volleyball needs for my school teams, and all of my club teams. They are truly professionals at their job and their accurate, timely, and customer driven service is second to none. There are many companies out there, but none that take of their customers like All Volleyball.<br\/><\/p>","author":"Hanah Kim","author_info":"Titan Athletics LLC \/ Abraham Lincoln HS","show_star_rating":true,"star_rating":5}},"e10d912e-aa9d-4a63-b623-91fb98e0912e":{"type":"testimonial","settings":{"testimonial":"<p>As the president of the Ursinus College Men's Club Volleyball team, I've used All Volleyball a number of times to order jerseys and equipment for our team. Each time the customer service has been great and very helpful and our orders have been processed and arrived quickly. I highly recommend All Volleyball for all of your volleyball needs.<\/p>","author":"Josh Wonsidler","author_info":"Ursinus College","show_star_rating":true,"star_rating":5}},"a66b91bb-4f66-4960-af59-1ae6a3a1ab7f":{"type":"testimonial","settings":{"testimonial":"<p>All Volleyball has been providing uniforms, equipment and other apparel for Southern Heat VBC, LLC. AV provides reliable and efficient service to our club by getting uniforms and apparel done when requested. Their workmanship is top class whether it screen printing or embroidery. All of AV's staff is very helpful and friendly when providing information needed for uniforms, etc. I highly recommend them for all your volleyball needs.<br\/><\/p>","author":"Kim Forcade","author_info":"Southern Heat VBC, LLC","show_star_rating":true,"star_rating":5}},"071c19dd-f47a-45cc-b0a2-bc36d6c0d38b":{"type":"testimonial","settings":{"testimonial":"<p>All Volleyball has been our only volleyball equipment provider since our club organized. They provide me with \"ALL\" that I need from uniforms to balls, shoes to practice gear. While I tried others when we first started, I decided long ago to stick with the best and for my time and money \"All Volleyball\" is \"all\" you need to know about and has everything you need. All Volleyball's customer service is second to none, their prices are competitive and fair and their attention to detail gives them high marks in every experience I have had.<br\/><\/p>","author":"Don Barkas","author_info":"Central Coast Spikers","show_star_rating":true,"star_rating":5}}},"block_order":["301931b9-5e54-4fc9-a241-3a760606d425","template--21622981558558__acb231b2-126d-4b79-a8bd-bbd3912bb9dd-testimonial-1","e10d912e-aa9d-4a63-b623-91fb98e0912e","a66b91bb-4f66-4960-af59-1ae6a3a1ab7f","071c19dd-f47a-45cc-b0a2-bc36d6c0d38b"],"settings":{"heading":"","show_quotes":true,"testimonial_size":"h6","text_position":"justify-center","text_align":"text-center justify-center","nav_style":"slideshow_nav_lines","transition":"slide-fade","autoplay":false,"slider_pause":false,"autoplay_speed":5,"color_scheme":"default","full_width":true}}},"order":["main","d455311f-fa25-4150-80bf-556f83c4f92e","d0111e30-dbd3-48d2-b0e3-65e40d139e36","acb231b2-126d-4b79-a8bd-bbd3912bb9dd"]}